graph torch-jit-export (
  %0[FLOAT, 2x3x224x224]
  %1[FLOAT, 64x3x7x7]
  %2[FLOAT, 64]
  %3[FLOAT, 64]
  %4[FLOAT, 64]
  %5[FLOAT, 64]
  %6[INT64, 1]
  %7[FLOAT, 64x64x1x1]
  %8[FLOAT, 64]
  %9[FLOAT, 64]
  %10[FLOAT, 64]
  %11[FLOAT, 64]
  %12[INT64, 1]
  %13[FLOAT, 64x64x3x3]
  %14[FLOAT, 64]
  %15[FLOAT, 64]
  %16[FLOAT, 64]
  %17[FLOAT, 64]
  %18[INT64, 1]
  %19[FLOAT, 256x64x1x1]
  %20[FLOAT, 256]
  %21[FLOAT, 256]
  %22[FLOAT, 256]
  %23[FLOAT, 256]
  %24[INT64, 1]
  %25[FLOAT, 256x64x1x1]
  %26[FLOAT, 256]
  %27[FLOAT, 256]
  %28[FLOAT, 256]
  %29[FLOAT, 256]
  %30[INT64, 1]
  %31[FLOAT, 64x256x1x1]
  %32[FLOAT, 64]
  %33[FLOAT, 64]
  %34[FLOAT, 64]
  %35[FLOAT, 64]
  %36[INT64, 1]
  %37[FLOAT, 64x64x3x3]
  %38[FLOAT, 64]
  %39[FLOAT, 64]
  %40[FLOAT, 64]
  %41[FLOAT, 64]
  %42[INT64, 1]
  %43[FLOAT, 256x64x1x1]
  %44[FLOAT, 256]
  %45[FLOAT, 256]
  %46[FLOAT, 256]
  %47[FLOAT, 256]
  %48[INT64, 1]
  %49[FLOAT, 64x256x1x1]
  %50[FLOAT, 64]
  %51[FLOAT, 64]
  %52[FLOAT, 64]
  %53[FLOAT, 64]
  %54[INT64, 1]
  %55[FLOAT, 64x64x3x3]
  %56[FLOAT, 64]
  %57[FLOAT, 64]
  %58[FLOAT, 64]
  %59[FLOAT, 64]
  %60[INT64, 1]
  %61[FLOAT, 256x64x1x1]
  %62[FLOAT, 256]
  %63[FLOAT, 256]
  %64[FLOAT, 256]
  %65[FLOAT, 256]
  %66[INT64, 1]
  %67[FLOAT, 128x256x1x1]
  %68[FLOAT, 128]
  %69[FLOAT, 128]
  %70[FLOAT, 128]
  %71[FLOAT, 128]
  %72[INT64, 1]
  %73[FLOAT, 128x128x3x3]
  %74[FLOAT, 128]
  %75[FLOAT, 128]
  %76[FLOAT, 128]
  %77[FLOAT, 128]
  %78[INT64, 1]
  %79[FLOAT, 512x128x1x1]
  %80[FLOAT, 512]
  %81[FLOAT, 512]
  %82[FLOAT, 512]
  %83[FLOAT, 512]
  %84[INT64, 1]
  %85[FLOAT, 512x256x1x1]
  %86[FLOAT, 512]
  %87[FLOAT, 512]
  %88[FLOAT, 512]
  %89[FLOAT, 512]
  %90[INT64, 1]
  %91[FLOAT, 128x512x1x1]
  %92[FLOAT, 128]
  %93[FLOAT, 128]
  %94[FLOAT, 128]
  %95[FLOAT, 128]
  %96[INT64, 1]
  %97[FLOAT, 128x128x3x3]
  %98[FLOAT, 128]
  %99[FLOAT, 128]
  %100[FLOAT, 128]
  %101[FLOAT, 128]
  %102[INT64, 1]
  %103[FLOAT, 512x128x1x1]
  %104[FLOAT, 512]
  %105[FLOAT, 512]
  %106[FLOAT, 512]
  %107[FLOAT, 512]
  %108[INT64, 1]
  %109[FLOAT, 128x512x1x1]
  %110[FLOAT, 128]
  %111[FLOAT, 128]
  %112[FLOAT, 128]
  %113[FLOAT, 128]
  %114[INT64, 1]
  %115[FLOAT, 128x128x3x3]
  %116[FLOAT, 128]
  %117[FLOAT, 128]
  %118[FLOAT, 128]
  %119[FLOAT, 128]
  %120[INT64, 1]
  %121[FLOAT, 512x128x1x1]
  %122[FLOAT, 512]
  %123[FLOAT, 512]
  %124[FLOAT, 512]
  %125[FLOAT, 512]
  %126[INT64, 1]
  %127[FLOAT, 128x512x1x1]
  %128[FLOAT, 128]
  %129[FLOAT, 128]
  %130[FLOAT, 128]
  %131[FLOAT, 128]
  %132[INT64, 1]
  %133[FLOAT, 128x128x3x3]
  %134[FLOAT, 128]
  %135[FLOAT, 128]
  %136[FLOAT, 128]
  %137[FLOAT, 128]
  %138[INT64, 1]
  %139[FLOAT, 512x128x1x1]
  %140[FLOAT, 512]
  %141[FLOAT, 512]
  %142[FLOAT, 512]
  %143[FLOAT, 512]
  %144[INT64, 1]
  %145[FLOAT, 256x512x1x1]
  %146[FLOAT, 256]
  %147[FLOAT, 256]
  %148[FLOAT, 256]
  %149[FLOAT, 256]
  %150[INT64, 1]
  %151[FLOAT, 256x256x3x3]
  %152[FLOAT, 256]
  %153[FLOAT, 256]
  %154[FLOAT, 256]
  %155[FLOAT, 256]
  %156[INT64, 1]
  %157[FLOAT, 1024x256x1x1]
  %158[FLOAT, 1024]
  %159[FLOAT, 1024]
  %160[FLOAT, 1024]
  %161[FLOAT, 1024]
  %162[INT64, 1]
  %163[FLOAT, 1024x512x1x1]
  %164[FLOAT, 1024]
  %165[FLOAT, 1024]
  %166[FLOAT, 1024]
  %167[FLOAT, 1024]
  %168[INT64, 1]
  %169[FLOAT, 256x1024x1x1]
  %170[FLOAT, 256]
  %171[FLOAT, 256]
  %172[FLOAT, 256]
  %173[FLOAT, 256]
  %174[INT64, 1]
  %175[FLOAT, 256x256x3x3]
  %176[FLOAT, 256]
  %177[FLOAT, 256]
  %178[FLOAT, 256]
  %179[FLOAT, 256]
  %180[INT64, 1]
  %181[FLOAT, 1024x256x1x1]
  %182[FLOAT, 1024]
  %183[FLOAT, 1024]
  %184[FLOAT, 1024]
  %185[FLOAT, 1024]
  %186[INT64, 1]
  %187[FLOAT, 256x1024x1x1]
  %188[FLOAT, 256]
  %189[FLOAT, 256]
  %190[FLOAT, 256]
  %191[FLOAT, 256]
  %192[INT64, 1]
  %193[FLOAT, 256x256x3x3]
  %194[FLOAT, 256]
  %195[FLOAT, 256]
  %196[FLOAT, 256]
  %197[FLOAT, 256]
  %198[INT64, 1]
  %199[FLOAT, 1024x256x1x1]
  %200[FLOAT, 1024]
  %201[FLOAT, 1024]
  %202[FLOAT, 1024]
  %203[FLOAT, 1024]
  %204[INT64, 1]
  %205[FLOAT, 256x1024x1x1]
  %206[FLOAT, 256]
  %207[FLOAT, 256]
  %208[FLOAT, 256]
  %209[FLOAT, 256]
  %210[INT64, 1]
  %211[FLOAT, 256x256x3x3]
  %212[FLOAT, 256]
  %213[FLOAT, 256]
  %214[FLOAT, 256]
  %215[FLOAT, 256]
  %216[INT64, 1]
  %217[FLOAT, 1024x256x1x1]
  %218[FLOAT, 1024]
  %219[FLOAT, 1024]
  %220[FLOAT, 1024]
  %221[FLOAT, 1024]
  %222[INT64, 1]
  %223[FLOAT, 256x1024x1x1]
  %224[FLOAT, 256]
  %225[FLOAT, 256]
  %226[FLOAT, 256]
  %227[FLOAT, 256]
  %228[INT64, 1]
  %229[FLOAT, 256x256x3x3]
  %230[FLOAT, 256]
  %231[FLOAT, 256]
  %232[FLOAT, 256]
  %233[FLOAT, 256]
  %234[INT64, 1]
  %235[FLOAT, 1024x256x1x1]
  %236[FLOAT, 1024]
  %237[FLOAT, 1024]
  %238[FLOAT, 1024]
  %239[FLOAT, 1024]
  %240[INT64, 1]
  %241[FLOAT, 256x1024x1x1]
  %242[FLOAT, 256]
  %243[FLOAT, 256]
  %244[FLOAT, 256]
  %245[FLOAT, 256]
  %246[INT64, 1]
  %247[FLOAT, 256x256x3x3]
  %248[FLOAT, 256]
  %249[FLOAT, 256]
  %250[FLOAT, 256]
  %251[FLOAT, 256]
  %252[INT64, 1]
  %253[FLOAT, 1024x256x1x1]
  %254[FLOAT, 1024]
  %255[FLOAT, 1024]
  %256[FLOAT, 1024]
  %257[FLOAT, 1024]
  %258[INT64, 1]
  %259[FLOAT, 512x1024x1x1]
  %260[FLOAT, 512]
  %261[FLOAT, 512]
  %262[FLOAT, 512]
  %263[FLOAT, 512]
  %264[INT64, 1]
  %265[FLOAT, 512x512x3x3]
  %266[FLOAT, 512]
  %267[FLOAT, 512]
  %268[FLOAT, 512]
  %269[FLOAT, 512]
  %270[INT64, 1]
  %271[FLOAT, 2048x512x1x1]
  %272[FLOAT, 2048]
  %273[FLOAT, 2048]
  %274[FLOAT, 2048]
  %275[FLOAT, 2048]
  %276[INT64, 1]
  %277[FLOAT, 2048x1024x1x1]
  %278[FLOAT, 2048]
  %279[FLOAT, 2048]
  %280[FLOAT, 2048]
  %281[FLOAT, 2048]
  %282[INT64, 1]
  %283[FLOAT, 512x2048x1x1]
  %284[FLOAT, 512]
  %285[FLOAT, 512]
  %286[FLOAT, 512]
  %287[FLOAT, 512]
  %288[INT64, 1]
  %289[FLOAT, 512x512x3x3]
  %290[FLOAT, 512]
  %291[FLOAT, 512]
  %292[FLOAT, 512]
  %293[FLOAT, 512]
  %294[INT64, 1]
  %295[FLOAT, 2048x512x1x1]
  %296[FLOAT, 2048]
  %297[FLOAT, 2048]
  %298[FLOAT, 2048]
  %299[FLOAT, 2048]
  %300[INT64, 1]
  %301[FLOAT, 512x2048x1x1]
  %302[FLOAT, 512]
  %303[FLOAT, 512]
  %304[FLOAT, 512]
  %305[FLOAT, 512]
  %306[INT64, 1]
  %307[FLOAT, 512x512x3x3]
  %308[FLOAT, 512]
  %309[FLOAT, 512]
  %310[FLOAT, 512]
  %311[FLOAT, 512]
  %312[INT64, 1]
  %313[FLOAT, 2048x512x1x1]
  %314[FLOAT, 2048]
  %315[FLOAT, 2048]
  %316[FLOAT, 2048]
  %317[FLOAT, 2048]
  %318[INT64, 1]
  %319[FLOAT, 1000x2048]
  %320[FLOAT, 1000]
) {
  %321 = Conv[dilations = [1, 1], group = 1, kernel_shape = [7, 7], pads = [3, 3, 3, 3], strides = [2, 2]](%0, %1)
  %322 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%321, %2, %3, %4, %5)
  %323 = Relu(%322)
  %324 = MaxPool[kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]](%323)
  %325 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%324, %7)
  %326 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%325, %8, %9, %10, %11)
  %327 = Relu(%326)
  %328 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%327, %13)
  %329 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%328, %14, %15, %16, %17)
  %330 = Relu(%329)
  %331 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%330, %19)
  %332 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%331, %20, %21, %22, %23)
  %333 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%324, %25)
  %334 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%333, %26, %27, %28, %29)
  %335 = Add(%332, %334)
  %336 = Relu(%335)
  %337 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%336, %31)
  %338 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%337, %32, %33, %34, %35)
  %339 = Relu(%338)
  %340 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%339, %37)
  %341 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%340, %38, %39, %40, %41)
  %342 = Relu(%341)
  %343 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%342, %43)
  %344 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%343, %44, %45, %46, %47)
  %345 = Add(%344, %336)
  %346 = Relu(%345)
  %347 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%346, %49)
  %348 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%347, %50, %51, %52, %53)
  %349 = Relu(%348)
  %350 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%349, %55)
  %351 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%350, %56, %57, %58, %59)
  %352 = Relu(%351)
  %353 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%352, %61)
  %354 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%353, %62, %63, %64, %65)
  %355 = Add(%354, %346)
  %356 = Relu(%355)
  %357 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%356, %67)
  %358 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%357, %68, %69, %70, %71)
  %359 = Relu(%358)
  %360 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]](%359, %73)
  %361 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%360, %74, %75, %76, %77)
  %362 = Relu(%361)
  %363 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%362, %79)
  %364 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%363, %80, %81, %82, %83)
  %365 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [2, 2]](%356, %85)
  %366 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%365, %86, %87, %88, %89)
  %367 = Add(%364, %366)
  %368 = Relu(%367)
  %369 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%368, %91)
  %370 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%369, %92, %93, %94, %95)
  %371 = Relu(%370)
  %372 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%371, %97)
  %373 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%372, %98, %99, %100, %101)
  %374 = Relu(%373)
  %375 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%374, %103)
  %376 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%375, %104, %105, %106, %107)
  %377 = Add(%376, %368)
  %378 = Relu(%377)
  %379 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%378, %109)
  %380 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%379, %110, %111, %112, %113)
  %381 = Relu(%380)
  %382 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%381, %115)
  %383 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%382, %116, %117, %118, %119)
  %384 = Relu(%383)
  %385 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%384, %121)
  %386 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%385, %122, %123, %124, %125)
  %387 = Add(%386, %378)
  %388 = Relu(%387)
  %389 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%388, %127)
  %390 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%389, %128, %129, %130, %131)
  %391 = Relu(%390)
  %392 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%391, %133)
  %393 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%392, %134, %135, %136, %137)
  %394 = Relu(%393)
  %395 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%394, %139)
  %396 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%395, %140, %141, %142, %143)
  %397 = Add(%396, %388)
  %398 = Relu(%397)
  %399 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%398, %145)
  %400 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%399, %146, %147, %148, %149)
  %401 = Relu(%400)
  %402 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]](%401, %151)
  %403 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%402, %152, %153, %154, %155)
  %404 = Relu(%403)
  %405 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%404, %157)
  %406 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%405, %158, %159, %160, %161)
  %407 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [2, 2]](%398, %163)
  %408 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%407, %164, %165, %166, %167)
  %409 = Add(%406, %408)
  %410 = Relu(%409)
  %411 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%410, %169)
  %412 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%411, %170, %171, %172, %173)
  %413 = Relu(%412)
  %414 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%413, %175)
  %415 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%414, %176, %177, %178, %179)
  %416 = Relu(%415)
  %417 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%416, %181)
  %418 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%417, %182, %183, %184, %185)
  %419 = Add(%418, %410)
  %420 = Relu(%419)
  %421 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%420, %187)
  %422 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%421, %188, %189, %190, %191)
  %423 = Relu(%422)
  %424 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%423, %193)
  %425 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%424, %194, %195, %196, %197)
  %426 = Relu(%425)
  %427 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%426, %199)
  %428 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%427, %200, %201, %202, %203)
  %429 = Add(%428, %420)
  %430 = Relu(%429)
  %431 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%430, %205)
  %432 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%431, %206, %207, %208, %209)
  %433 = Relu(%432)
  %434 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%433, %211)
  %435 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%434, %212, %213, %214, %215)
  %436 = Relu(%435)
  %437 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%436, %217)
  %438 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%437, %218, %219, %220, %221)
  %439 = Add(%438, %430)
  %440 = Relu(%439)
  %441 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%440, %223)
  %442 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%441, %224, %225, %226, %227)
  %443 = Relu(%442)
  %444 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%443, %229)
  %445 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%444, %230, %231, %232, %233)
  %446 = Relu(%445)
  %447 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%446, %235)
  %448 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%447, %236, %237, %238, %239)
  %449 = Add(%448, %440)
  %450 = Relu(%449)
  %451 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%450, %241)
  %452 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%451, %242, %243, %244, %245)
  %453 = Relu(%452)
  %454 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%453, %247)
  %455 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%454, %248, %249, %250, %251)
  %456 = Relu(%455)
  %457 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%456, %253)
  %458 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%457, %254, %255, %256, %257)
  %459 = Add(%458, %450)
  %460 = Relu(%459)
  %461 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%460, %259)
  %462 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%461, %260, %261, %262, %263)
  %463 = Relu(%462)
  %464 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [2, 2]](%463, %265)
  %465 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%464, %266, %267, %268, %269)
  %466 = Relu(%465)
  %467 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%466, %271)
  %468 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%467, %272, %273, %274, %275)
  %469 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [2, 2]](%460, %277)
  %470 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%469, %278, %279, %280, %281)
  %471 = Add(%468, %470)
  %472 = Relu(%471)
  %473 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%472, %283)
  %474 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%473, %284, %285, %286, %287)
  %475 = Relu(%474)
  %476 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%475, %289)
  %477 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%476, %290, %291, %292, %293)
  %478 = Relu(%477)
  %479 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%478, %295)
  %480 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%479, %296, %297, %298, %299)
  %481 = Add(%480, %472)
  %482 = Relu(%481)
  %483 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%482, %301)
  %484 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%483, %302, %303, %304, %305)
  %485 = Relu(%484)
  %486 = Conv[dilations = [1, 1], group = 1, kernel_shape = [3, 3], pads = [1, 1, 1, 1], strides = [1, 1]](%485, %307)
  %487 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%486, %308, %309, %310, %311)
  %488 = Relu(%487)
  %489 = Conv[dilations = [1, 1], group = 1, kernel_shape = [1, 1], pads = [0, 0, 0, 0], strides = [1, 1]](%488, %313)
  %490 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%489, %314, %315, %316, %317)
  %491 = Add(%490, %482)
  %492 = Relu(%491)
  %493 = AveragePool[kernel_shape = [7, 7], pads = [0, 0, 0, 0], strides = [7, 7]](%492)
  %494 = Flatten[axis = 1](%493)
  %495 = Gemm[alpha = 1, beta = 1, broadcast = 1, transB = 1](%494, %319, %320)
  return %495
}