ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "728"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "728"
    input: "2"
    input: "3"
    input: "4"
    input: "5"
    output: "729"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "729"
    output: "730"
    op_type: "Relu"
  }
  node {
    input: "730"
    output: "731"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "731"
    input: "7"
    input: "8"
    input: "9"
    input: "10"
    output: "732"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "732"
    output: "733"
    op_type: "Relu"
  }
  node {
    input: "733"
    input: "12"
    output: "734"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "734"
    input: "13"
    input: "14"
    input: "15"
    input: "16"
    output: "735"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "735"
    output: "736"
    op_type: "Relu"
  }
  node {
    input: "736"
    input: "18"
    output: "737"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "731"
    input: "737"
    output: "738"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "738"
    input: "19"
    input: "20"
    input: "21"
    input: "22"
    output: "739"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "739"
    output: "740"
    op_type: "Relu"
  }
  node {
    input: "740"
    input: "24"
    output: "741"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "741"
    input: "25"
    input: "26"
    input: "27"
    input: "28"
    output: "742"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "742"
    output: "743"
    op_type: "Relu"
  }
  node {
    input: "743"
    input: "30"
    output: "744"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "738"
    input: "744"
    output: "745"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "745"
    input: "31"
    input: "32"
    input: "33"
    input: "34"
    output: "746"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "746"
    output: "747"
    op_type: "Relu"
  }
  node {
    input: "747"
    input: "36"
    output: "748"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "748"
    input: "37"
    input: "38"
    input: "39"
    input: "40"
    output: "749"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "749"
    output: "750"
    op_type: "Relu"
  }
  node {
    input: "750"
    input: "42"
    output: "751"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "745"
    input: "751"
    output: "752"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "752"
    input: "43"
    input: "44"
    input: "45"
    input: "46"
    output: "753"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "753"
    output: "754"
    op_type: "Relu"
  }
  node {
    input: "754"
    input: "48"
    output: "755"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "755"
    input: "49"
    input: "50"
    input: "51"
    input: "52"
    output: "756"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "756"
    output: "757"
    op_type: "Relu"
  }
  node {
    input: "757"
    input: "54"
    output: "758"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "752"
    input: "758"
    output: "759"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "759"
    input: "55"
    input: "56"
    input: "57"
    input: "58"
    output: "760"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "760"
    output: "761"
    op_type: "Relu"
  }
  node {
    input: "761"
    input: "60"
    output: "762"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "762"
    input: "61"
    input: "62"
    input: "63"
    input: "64"
    output: "763"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "763"
    output: "764"
    op_type: "Relu"
  }
  node {
    input: "764"
    input: "66"
    output: "765"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "759"
    input: "765"
    output: "766"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "766"
    input: "67"
    input: "68"
    input: "69"
    input: "70"
    output: "767"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "767"
    output: "768"
    op_type: "Relu"
  }
  node {
    input: "768"
    input: "72"
    output: "769"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "769"
    input: "73"
    input: "74"
    input: "75"
    input: "76"
    output: "770"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "770"
    output: "771"
    op_type: "Relu"
  }
  node {
    input: "771"
    input: "78"
    output: "772"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "766"
    input: "772"
    output: "773"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "773"
    input: "79"
    input: "80"
    input: "81"
    input: "82"
    output: "774"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "774"
    output: "775"
    op_type: "Relu"
  }
  node {
    input: "775"
    input: "84"
    output: "776"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "776"
    output: "777"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "777"
    input: "85"
    input: "86"
    input: "87"
    input: "88"
    output: "778"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "778"
    output: "779"
    op_type: "Relu"
  }
  node {
    input: "779"
    input: "90"
    output: "780"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "780"
    input: "91"
    input: "92"
    input: "93"
    input: "94"
    output: "781"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "781"
    output: "782"
    op_type: "Relu"
  }
  node {
    input: "782"
    input: "96"
    output: "783"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "777"
    input: "783"
    output: "784"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "784"
    input: "97"
    input: "98"
    input: "99"
    input: "100"
    output: "785"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "785"
    output: "786"
    op_type: "Relu"
  }
  node {
    input: "786"
    input: "102"
    output: "787"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "787"
    input: "103"
    input: "104"
    input: "105"
    input: "106"
    output: "788"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "788"
    output: "789"
    op_type: "Relu"
  }
  node {
    input: "789"
    input: "108"
    output: "790"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "784"
    input: "790"
    output: "791"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "791"
    input: "109"
    input: "110"
    input: "111"
    input: "112"
    output: "792"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "792"
    output: "793"
    op_type: "Relu"
  }
  node {
    input: "793"
    input: "114"
    output: "794"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "794"
    input: "115"
    input: "116"
    input: "117"
    input: "118"
    output: "795"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "795"
    output: "796"
    op_type: "Relu"
  }
  node {
    input: "796"
    input: "120"
    output: "797"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "791"
    input: "797"
    output: "798"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "798"
    input: "121"
    input: "122"
    input: "123"
    input: "124"
    output: "799"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "799"
    output: "800"
    op_type: "Relu"
  }
  node {
    input: "800"
    input: "126"
    output: "801"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "801"
    input: "127"
    input: "128"
    input: "129"
    input: "130"
    output: "802"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "802"
    output: "803"
    op_type: "Relu"
  }
  node {
    input: "803"
    input: "132"
    output: "804"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "798"
    input: "804"
    output: "805"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "805"
    input: "133"
    input: "134"
    input: "135"
    input: "136"
    output: "806"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "806"
    output: "807"
    op_type: "Relu"
  }
  node {
    input: "807"
    input: "138"
    output: "808"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "808"
    input: "139"
    input: "140"
    input: "141"
    input: "142"
    output: "809"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "809"
    output: "810"
    op_type: "Relu"
  }
  node {
    input: "810"
    input: "144"
    output: "811"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "805"
    input: "811"
    output: "812"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "812"
    input: "145"
    input: "146"
    input: "147"
    input: "148"
    output: "813"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "813"
    output: "814"
    op_type: "Relu"
  }
  node {
    input: "814"
    input: "150"
    output: "815"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "815"
    input: "151"
    input: "152"
    input: "153"
    input: "154"
    output: "816"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "816"
    output: "817"
    op_type: "Relu"
  }
  node {
    input: "817"
    input: "156"
    output: "818"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "812"
    input: "818"
    output: "819"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "819"
    input: "157"
    input: "158"
    input: "159"
    input: "160"
    output: "820"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "820"
    output: "821"
    op_type: "Relu"
  }
  node {
    input: "821"
    input: "162"
    output: "822"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "822"
    input: "163"
    input: "164"
    input: "165"
    input: "166"
    output: "823"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "823"
    output: "824"
    op_type: "Relu"
  }
  node {
    input: "824"
    input: "168"
    output: "825"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "819"
    input: "825"
    output: "826"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "826"
    input: "169"
    input: "170"
    input: "171"
    input: "172"
    output: "827"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "827"
    output: "828"
    op_type: "Relu"
  }
  node {
    input: "828"
    input: "174"
    output: "829"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "829"
    input: "175"
    input: "176"
    input: "177"
    input: "178"
    output: "830"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "830"
    output: "831"
    op_type: "Relu"
  }
  node {
    input: "831"
    input: "180"
    output: "832"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "826"
    input: "832"
    output: "833"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "833"
    input: "181"
    input: "182"
    input: "183"
    input: "184"
    output: "834"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "834"
    output: "835"
    op_type: "Relu"
  }
  node {
    input: "835"
    input: "186"
    output: "836"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "836"
    input: "187"
    input: "188"
    input: "189"
    input: "190"
    output: "837"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "837"
    output: "838"
    op_type: "Relu"
  }
  node {
    input: "838"
    input: "192"
    output: "839"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "833"
    input: "839"
    output: "840"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "840"
    input: "193"
    input: "194"
    input: "195"
    input: "196"
    output: "841"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "841"
    output: "842"
    op_type: "Relu"
  }
  node {
    input: "842"
    input: "198"
    output: "843"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "843"
    input: "199"
    input: "200"
    input: "201"
    input: "202"
    output: "844"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "844"
    output: "845"
    op_type: "Relu"
  }
  node {
    input: "845"
    input: "204"
    output: "846"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "840"
    input: "846"
    output: "847"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "847"
    input: "205"
    input: "206"
    input: "207"
    input: "208"
    output: "848"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "848"
    output: "849"
    op_type: "Relu"
  }
  node {
    input: "849"
    input: "210"
    output: "850"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "850"
    input: "211"
    input: "212"
    input: "213"
    input: "214"
    output: "851"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "851"
    output: "852"
    op_type: "Relu"
  }
  node {
    input: "852"
    input: "216"
    output: "853"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "847"
    input: "853"
    output: "854"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "854"
    input: "217"
    input: "218"
    input: "219"
    input: "220"
    output: "855"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "855"
    output: "856"
    op_type: "Relu"
  }
  node {
    input: "856"
    input: "222"
    output: "857"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "857"
    input: "223"
    input: "224"
    input: "225"
    input: "226"
    output: "858"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "858"
    output: "859"
    op_type: "Relu"
  }
  node {
    input: "859"
    input: "228"
    output: "860"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "854"
    input: "860"
    output: "861"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "861"
    input: "229"
    input: "230"
    input: "231"
    input: "232"
    output: "862"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "862"
    output: "863"
    op_type: "Relu"
  }
  node {
    input: "863"
    input: "234"
    output: "864"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "864"
    output: "865"
    op_type: "AveragePool"
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "865"
    input: "235"
    input: "236"
    input: "237"
    input: "238"
    output: "866"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "866"
    output: "867"
    op_type: "Relu"
  }
  node {
    input: "867"
    input: "240"
    output: "868"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "868"
    input: "241"
    input: "242"
    input: "243"
    input: "244"
    output: "869"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "869"
    output: "870"
    op_type: "Relu"
  }
  node {
    input: "870"
    input: "246"
    output: "871"
    op_type: "Conv"
