ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "321"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 3
      ints: 3
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "321"
    input: "2"
    input: "3"
    input: "4"
    input: "5"
    output: "322"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "322"
    output: "323"
    op_type: "Relu"
  }
  node {
    input: "323"
    output: "324"
    op_type: "MaxPool"
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "324"
    input: "7"
    output: "325"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "325"
    input: "8"
    input: "9"
    input: "10"
    input: "11"
    output: "326"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "326"
    output: "327"
    op_type: "Relu"
  }
  node {
    input: "327"
    input: "13"
    output: "328"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "328"
    input: "14"
    input: "15"
    input: "16"
    input: "17"
    output: "329"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "329"
    output: "330"
    op_type: "Relu"
  }
  node {
    input: "330"
    input: "19"
    output: "331"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "331"
    input: "20"
    input: "21"
    input: "22"
    input: "23"
    output: "332"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "324"
    input: "25"
    output: "333"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "333"
    input: "26"
    input: "27"
    input: "28"
    input: "29"
    output: "334"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "332"
    input: "334"
    output: "335"
    op_type: "Add"
  }
  node {
    input: "335"
    output: "336"
    op_type: "Relu"
  }
  node {
    input: "336"
    input: "31"
    output: "337"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "337"
    input: "32"
    input: "33"
    input: "34"
    input: "35"
    output: "338"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "338"
    output: "339"
    op_type: "Relu"
  }
  node {
    input: "339"
    input: "37"
    output: "340"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "340"
    input: "38"
    input: "39"
    input: "40"
    input: "41"
    output: "341"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "341"
    output: "342"
    op_type: "Relu"
  }
  node {
    input: "342"
    input: "43"
    output: "343"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "343"
    input: "44"
    input: "45"
    input: "46"
    input: "47"
    output: "344"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "344"
    input: "336"
    output: "345"
    op_type: "Add"
  }
  node {
    input: "345"
    output: "346"
    op_type: "Relu"
  }
  node {
    input: "346"
    input: "49"
    output: "347"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "347"
    input: "50"
    input: "51"
    input: "52"
    input: "53"
    output: "348"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "348"
    output: "349"
    op_type: "Relu"
  }
  node {
    input: "349"
    input: "55"
    output: "350"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "350"
    input: "56"
    input: "57"
    input: "58"
    input: "59"
    output: "351"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "351"
    output: "352"
    op_type: "Relu"
  }
  node {
    input: "352"
    input: "61"
    output: "353"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "353"
    input: "62"
    input: "63"
    input: "64"
    input: "65"
    output: "354"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "354"
    input: "346"
    output: "355"
    op_type: "Add"
  }
  node {
    input: "355"
    output: "356"
    op_type: "Relu"
  }
  node {
    input: "356"
    input: "67"
    output: "357"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "357"
    input: "68"
    input: "69"
    input: "70"
    input: "71"
    output: "358"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "358"
    output: "359"
    op_type: "Relu"
  }
  node {
    input: "359"
    input: "73"
    output: "360"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "360"
    input: "74"
    input: "75"
    input: "76"
    input: "77"
    output: "361"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "361"
    output: "362"
    op_type: "Relu"
  }
  node {
    input: "362"
    input: "79"
    output: "363"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "363"
    input: "80"
    input: "81"
    input: "82"
    input: "83"
    output: "364"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "356"
    input: "85"
    output: "365"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "365"
    input: "86"
    input: "87"
    input: "88"
    input: "89"
    output: "366"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "364"
    input: "366"
    output: "367"
    op_type: "Add"
  }
  node {
    input: "367"
    output: "368"
    op_type: "Relu"
  }
  node {
    input: "368"
    input: "91"
    output: "369"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "369"
    input: "92"
    input: "93"
    input: "94"
    input: "95"
    output: "370"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "370"
    output: "371"
    op_type: "Relu"
  }
  node {
    input: "371"
    input: "97"
    output: "372"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "372"
    input: "98"
    input: "99"
    input: "100"
    input: "101"
    output: "373"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "373"
    output: "374"
    op_type: "Relu"
  }
  node {
    input: "374"
    input: "103"
    output: "375"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "375"
    input: "104"
    input: "105"
    input: "106"
    input: "107"
    output: "376"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "376"
    input: "368"
    output: "377"
    op_type: "Add"
  }
  node {
    input: "377"
    output: "378"
    op_type: "Relu"
  }
  node {
    input: "378"
    input: "109"
    output: "379"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "379"
    input: "110"
    input: "111"
    input: "112"
    input: "113"
    output: "380"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "380"
    output: "381"
    op_type: "Relu"
  }
  node {
    input: "381"
    input: "115"
    output: "382"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "382"
    input: "116"
    input: "117"
    input: "118"
    input: "119"
    output: "383"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "383"
    output: "384"
    op_type: "Relu"
  }
  node {
    input: "384"
    input: "121"
    output: "385"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "385"
    input: "122"
    input: "123"
    input: "124"
    input: "125"
    output: "386"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "386"
    input: "378"
    output: "387"
    op_type: "Add"
  }
  node {
    input: "387"
    output: "388"
    op_type: "Relu"
  }
  node {
    input: "388"
    input: "127"
    output: "389"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "389"
    input: "128"
    input: "129"
    input: "130"
    input: "131"
    output: "390"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "390"
    output: "391"
    op_type: "Relu"
  }
  node {
    input: "391"
    input: "133"
    output: "392"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "392"
    input: "134"
    input: "135"
    input: "136"
    input: "137"
    output: "393"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "393"
    output: "394"
    op_type: "Relu"
  }
  node {
    input: "394"
    input: "139"
    output: "395"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "395"
    input: "140"
    input: "141"
    input: "142"
    input: "143"
    output: "396"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "396"
    input: "388"
    output: "397"
    op_type: "Add"
  }
  node {
    input: "397"
    output: "398"
    op_type: "Relu"
  }
  node {
    input: "398"
    input: "145"
    output: "399"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "399"
    input: "146"
    input: "147"
    input: "148"
    input: "149"
    output: "400"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "400"
    output: "401"
    op_type: "Relu"
  }
  node {
    input: "401"
    input: "151"
    output: "402"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "402"
    input: "152"
    input: "153"
    input: "154"
    input: "155"
    output: "403"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "403"
    output: "404"
    op_type: "Relu"
  }
  node {
    input: "404"
    input: "157"
    output: "405"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "405"
    input: "158"
    input: "159"
    input: "160"
    input: "161"
    output: "406"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "398"
    input: "163"
    output: "407"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "407"
    input: "164"
    input: "165"
    input: "166"
    input: "167"
    output: "408"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "406"
    input: "408"
    output: "409"
    op_type: "Add"
  }
  node {
    input: "409"
    output: "410"
    op_type: "Relu"
  }
  node {
    input: "410"
    input: "169"
    output: "411"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "411"
    input: "170"
    input: "171"
    input: "172"
    input: "173"
    output: "412"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "412"
    output: "413"
    op_type: "Relu"
  }
  node {
    input: "413"
    input: "175"
    output: "414"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "414"
    input: "176"
    input: "177"
    input: "178"
    input: "179"
    output: "415"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "415"
    output: "416"
    op_type: "Relu"
  }
  node {
    input: "416"
    input: "181"
    output: "417"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "417"
    input: "182"
    input: "183"
    input: "184"
    input: "185"
    output: "418"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "418"
    input: "410"
    output: "419"
    op_type: "Add"
  }
  node {
    input: "419"
    output: "420"
    op_type: "Relu"
  }
  node {
    input: "420"
    input: "187"
    output: "421"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "421"
    input: "188"
    input: "189"
    input: "190"
    input: "191"
    output: "422"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "422"
    output: "423"
    op_type: "Relu"
  }
  node {
    input: "423"
    input: "193"
    output: "424"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "424"
    input: "194"
    input: "195"
    input: "196"
    input: "197"
    output: "425"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "425"
    output: "426"
    op_type: "Relu"
  }
  node {
    input: "426"
    input: "199"
    output: "427"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "427"
    input: "200"
    input: "201"
    input: "202"
    input: "203"
    output: "428"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "428"
    input: "420"
    output: "429"
    op_type: "Add"
  }
  node {
    input: "429"
    output: "430"
    op_type: "Relu"
  }
  node {
    input: "430"
    input: "205"
    output: "431"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "431"
    input: "206"
    input: "207"
    input: "208"
    input: "209"
    output: "432"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "432"
    output: "433"
    op_type: "Relu"
  }
  node {
    input: "433"
    input: "211"
    output: "434"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "434"
    input: "212"
    input: "213"
    input: "214"
    input: "215"
    output: "435"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "435"
    output: "436"
    op_type: "Relu"
  }
  node {
    input: "436"
    input: "217"
    output: "437"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "437"
    input: "218"
    input: "219"
    input: "220"
    input: "221"
    output: "438"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "438"
    input: "430"
    output: "439"
    op_type: "Add"
  }
  node {
    input: "439"
    output: "440"
    op_type: "Relu"
  }
  node {
    input: "440"
    input: "223"
    output: "441"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "441"
    input: "224"
    input: "225"
    input: "226"
    input: "227"
    output: "442"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "442"
    output: "443"
    op_type: "Relu"
  }
  node {
    input: "443"
    input: "229"
    output: "444"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "444"
    input: "230"
    input: "231"
    input: "232"
    input: "233"
    output: "445"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "445"
    output: "446"
    op_type: "Relu"
  }
  node {
    input: "446"
    input: "235"
    output: "447"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "447"
    input: "236"
    input: "237"
    input: "238"
    input: "239"
    output: "448"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "448"
    input: "440"
    output: "449"
    op_type: "Add"
  }
  node {
    input: "449"
    output: "450"
    op_type: "Relu"
  }
  node {
    input: "450"
    input: "241"
    output: "451"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "451"
    input: "242"
    input: "243"
    input: "244"
    input: "245"
    output: "452"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "452"
    output: "453"
    op_type: "Relu"
  }
  node {
    input: "453"
    input: "247"
    output: "454"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "454"
    input: "248"
    input: "249"
    input: "250"
    input: "251"
    output: "455"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "455"
    output: "456"
    op_type: "Relu"
  }
  node {
    input: "456"
    input: "253"
    output: "457"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "457"
    input: "254"
    input: "255"
    input: "256"
    input: "257"
    output: "458"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "458"
    input: "450"
    output: "459"
