graph torch-jit-export (
  %0[FLOAT, 64x3x64x64]
  %1[FLOAT, 64x3x4x4]
  %2[FLOAT, 128x64x4x4]
  %3[FLOAT, 128]
  %4[FLOAT, 128]
  %5[FLOAT, 128]
  %6[FLOAT, 128]
  %7[INT64, 1]
  %8[FLOAT, 256x128x4x4]
  %9[FLOAT, 256]
  %10[FLOAT, 256]
  %11[FLOAT, 256]
  %12[FLOAT, 256]
  %13[INT64, 1]
  %14[FLOAT, 512x256x4x4]
  %15[FLOAT, 512]
  %16[FLOAT, 512]
  %17[FLOAT, 512]
  %18[FLOAT, 512]
  %19[INT64, 1]
  %20[FLOAT, 1x512x4x4]
) {
  %21 = Conv[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%0, %1)
  %22 = LeakyRelu[alpha = 0.200000002980232](%21)
  %23 = Conv[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%22, %2)
  %24 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%23, %3, %4, %5, %6)
  %25 = LeakyRelu[alpha = 0.200000002980232](%24)
  %26 = Conv[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%25, %8)
  %27 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%26, %9, %10, %11, %12)
  %28 = LeakyRelu[alpha = 0.200000002980232](%27)
  %29 = Conv[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%28, %14)
  %30 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%29, %15, %16, %17, %18)
  %31 = LeakyRelu[alpha = 0.200000002980232](%30)
  %32 = Conv[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [0, 0, 0, 0], strides = [1, 1]](%31, %20)
  %33 = Sigmoid(%32)
  %34 = Constant[value = <Tensor>]()
  %35 = Reshape(%33, %34)
  return %35
}