ir_version: 2
producer_name: "pytorch"
producer_version: "0.3"
graph {
  node {
    input: "0"
    input: "1"
    output: "21"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "21"
    output: "22"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    input: "22"
    input: "2"
    output: "23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "23"
    input: "3"
    input: "4"
    input: "5"
    input: "6"
    output: "24"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "24"
    output: "25"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    input: "25"
    input: "8"
    output: "26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "26"
    input: "9"
    input: "10"
    input: "11"
    input: "12"
    output: "27"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "27"
    output: "28"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    input: "28"
    input: "14"
    output: "29"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "29"
    input: "15"
    input: "16"
    input: "17"
    input: "18"
    output: "30"
    op_type: "BatchNormalization"
    attribute {
      name: "consumed_inputs"
      ints: 0
      ints: 0
      ints: 0
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "epsilon"
      f: 9.99999974737875e-06
      type: FLOAT
    }
    attribute {
      name: "is_test"
      i: 1
      type: INT
    }
    attribute {
      name: "momentum"
      f: 1
      type: FLOAT
    }
  }
  node {
    input: "30"
    output: "31"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.200000002980232
      type: FLOAT
    }
  }
  node {
    input: "31"
    input: "20"
    output: "32"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "32"
    output: "33"
    op_type: "Sigmoid"
  }
  node {
    output: "34"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: INT64
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "33"
    input: "34"
    output: "35"
    op_type: "Reshape"
  }
  name: "torch-jit-export"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 64
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "4"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "5"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "6"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "7"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "8"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 128
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "9"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "10"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "11"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "12"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 256
          }
        }
      }
    }
  }
  input {
    name: "13"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "14"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 256
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "15"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "16"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "17"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "18"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 512
          }
        }
      }
    }
  }
  input {
    name: "19"
    type {
      tensor_type {
        elem_type: INT64
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "20"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 512
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "35"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 5
}
