graph torch-jit-export (
  %0[FLOAT, 64x100x1x1]
  %1[FLOAT, 100x512x4x4]
  %2[FLOAT, 512]
  %3[FLOAT, 512]
  %4[FLOAT, 512]
  %5[FLOAT, 512]
  %6[INT64, 1]
  %7[FLOAT, 512x256x4x4]
  %8[FLOAT, 256]
  %9[FLOAT, 256]
  %10[FLOAT, 256]
  %11[FLOAT, 256]
  %12[INT64, 1]
  %13[FLOAT, 256x128x4x4]
  %14[FLOAT, 128]
  %15[FLOAT, 128]
  %16[FLOAT, 128]
  %17[FLOAT, 128]
  %18[INT64, 1]
  %19[FLOAT, 128x64x4x4]
  %20[FLOAT, 64]
  %21[FLOAT, 64]
  %22[FLOAT, 64]
  %23[FLOAT, 64]
  %24[INT64, 1]
  %25[FLOAT, 64x3x4x4]
) {
  %26 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [0, 0, 0, 0], strides = [1, 1]](%0, %1)
  %27 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%26, %2, %3, %4, %5)
  %28 = Relu(%27)
  %29 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%28, %7)
  %30 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%29, %8, %9, %10, %11)
  %31 = Relu(%30)
  %32 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%31, %13)
  %33 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%32, %14, %15, %16, %17)
  %34 = Relu(%33)
  %35 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%34, %19)
  %36 = BatchNormalization[consumed_inputs = [0, 0, 0, 1, 1], epsilon = 9.99999974737875e-06, is_test = 1, momentum = 1](%35, %20, %21, %22, %23)
  %37 = Relu(%36)
  %38 = ConvTranspose[dilations = [1, 1], group = 1, kernel_shape = [4, 4], pads = [1, 1, 1, 1], strides = [2, 2]](%37, %25)
  %39 = Tanh(%38)
  return %39
}